[
  {
    "neighborhood": "Upper East Side",
    "price": 2000000,
    "bedrooms": 3,
    "bathrooms": 2.5,
    "house_size": 2000,
    "property_description": "Beautiful brownstone townhouse with a spacious living room, updated kitchen, and private backyard. Master suite with walk-in closet and en-suite bathroom. Located on a tree-lined street close to Central Park.",
    "neighborhood_description": "The Upper East Side is known for its upscale shops, restaurants, and cultural institutions. It is a desirable neighborhood with a mix of historic buildings and modern amenities."
  },
  {
    "neighborhood": "Silver Lake",
    "price": 800000,
    "bedrooms": 2,
    "bathrooms": 1,
    "house_size": 1200,
    "property_description": "Charming bungalow with open floor plan, hardwood floors, and updated kitchen. Large backyard with deck for outdoor entertaining. Walking distance to the lake and local cafes.",
    "neighborhood_description": "Silver Lake is a trendy neighborhood known for its hipster vibe, eclectic shops, and vibrant arts scene. It is a popular destination for young professionals and creatives."
  },
  {
    "neighborhood": "Beverly Hills",
    "price": 5000000,
    "bedrooms": 5,
    "bathrooms": 4,
    "house_size": 4000,
    "property_description": "Luxurious mansion with high ceilings, marble floors, and custom finishes throughout. Gourmet kitchen, home theater, and swimming pool. Gated property with lush landscaping for privacy.",
    "neighborhood_description": "Beverly Hills is an exclusive neighborhood known for its celebrity residents, designer boutiques, and upscale dining. It is a prestigious area with some of the most expensive real estate in the country."
  },
  {
    "neighborhood": "South Beach",
    "price": 1200000,
    "bedrooms": 1,
    "bathrooms": 1.5,
    "house_size": 800,
    "property_description": "Modern condo with ocean views, floor-to-ceiling windows, and designer finishes. Rooftop pool, fitness center, and concierge services. Steps away from the beach and trendy nightlife.",
    "neighborhood_description": "South Beach is a vibrant neighborhood known for its Art Deco architecture, white sand beaches, and lively entertainment scene. It attracts visitors from around the world looking for sun, sand, and excitement."
  },
  {
    "neighborhood": "Brooklyn Heights",
    "price": 1500000,
    "bedrooms": 4,
    "bathrooms": 3,
    "house_size": 2500,
    "property_description": "Historic brownstone with original details, including crown moldings and hardwood floors. Renovated kitchen with stainless steel appliances. Backyard garden and rooftop terrace with city views.",
    "neighborhood_description": "Brooklyn Heights is a picturesque neighborhood with tree-lined streets, historic homes, and stunning views of the Manhattan skyline. It has a strong sense of community and is popular with families and young professionals."
  },
  {
    "neighborhood": "Pacific Heights",
    "price": 3000000,
    "bedrooms": 6,
    "bathrooms": 4.5,
    "house_size": 3500,
    "property_description": "Elegant Victorian home with grand staircase, formal dining room, and wine cellar. Chef's kitchen with top-of-the-line appliances. Landscaped backyard with patio and hot tub.",
    "neighborhood_description": "Pacific Heights is a prestigious neighborhood known for its historic mansions, sweeping views of the bay, and upscale shopping. It is a sought-after area with a mix of old-world charm and modern amenities."
  },
  {
    "neighborhood": "Downtown LA",
    "price": 1000000,
    "bedrooms": 2,
    "bathrooms": 2,
    "house_size": 1500,
    "property_description": "Contemporary loft with industrial-chic design, exposed brick walls, and high ceilings. Open concept living space, designer kitchen, and balcony with city views. Building amenities include rooftop pool and fitness center.",
    "neighborhood_description": "Downtown LA is a bustling neighborhood with a mix of historic buildings and modern skyscrapers. It is a cultural hub with theaters, art galleries, and trendy restaurants. The area has seen a revival in recent years with new residential developments and entertainment options."
  },
  {
    "neighborhood": "Georgetown",
    "price": 1800000,
    "bedrooms": 3,
    "bathrooms": 2.5,
    "house_size": 2200,
    "property_description": "Federal-style townhouse with original woodwork, fireplace, and custom built-ins. Updated kitchen with granite countertops and stainless steel appliances. Private patio and garden for outdoor dining.",
    "neighborhood_description": "Georgetown is a historic neighborhood known for its cobblestone streets, historic architecture, and upscale shops. It is a charming area with a mix of residential homes, boutique stores, and waterfront parks."
  },
  {
    "neighborhood": "Nob Hill",
    "price": 2500000,
    "bedrooms": 4,
    "bathrooms": 3,
    "house_size": 2800,
    "property_description": "Classic Victorian home with period details, stained glass windows, and hardwood floors. Remodeled kitchen with high-end appliances. Landscaped backyard with deck and hot tub.",
    "neighborhood_description": "Nob Hill is a prestigious neighborhood known for its historic mansions, luxury hotels, and panoramic views of the city. It is an affluent area with a mix of grand homes, upscale shops, and fine dining establishments."
  },
  {
    "neighborhood": "The Hamptons",
    "price": 7000000,
    "bedrooms": 7,
    "bathrooms": 5,
    "house_size": 5000,
    "property_description": "Waterfront estate with private beach access, dock, and tennis court. Spacious living areas, gourmet kitchen, and home theater. Expansive outdoor spaces for entertaining and enjoying the ocean views.",
    "neighborhood_description": "The Hamptons is a luxurious resort area known for its beachfront estates, upscale boutiques, and celebrity residents. It is a popular summer destination for wealthy New Yorkers looking to escape the city and enjoy the beach lifestyle."
  }
]