[
  {
    "neighborhood": "Brooklyn Heights",
    "price": 1500000,
    "bedrooms": 3,
    "bathrooms": 2,
    "house_size": 2000,
    "property_description": "Beautiful brownstone townhouse with original details and modern upgrades. Spacious living room, renovated kitchen, and private backyard. Located in a historic and charming neighborhood.",
    "neighborhood_description": "Brooklyn Heights is known for its tree-lined streets, historic architecture, and stunning views of the Manhattan skyline. Close to parks, restaurants, and public transportation."
  },
  {
    "neighborhood": "Beverly Hills",
    "price": 5000000,
    "bedrooms": 5,
    "bathrooms": 6,
    "house_size": 6000,
    "property_description": "Luxurious mansion with high-end finishes and amenities. Grand foyer, gourmet kitchen, home theater, and pool. Situated in the prestigious Beverly Hills neighborhood.",
    "neighborhood_description": "Beverly Hills is synonymous with luxury and celebrity. Known for its upscale shops, fine dining, and iconic landmarks like Rodeo Drive and the Beverly Hills Hotel."
  },
  {
    "neighborhood": "Soho",
    "price": 2000000,
    "bedrooms": 2,
    "bathrooms": 2,
    "house_size": 1500,
    "property_description": "Chic loft with exposed brick walls and high ceilings. Open floor plan, designer kitchen, and rooftop terrace with city views. Located in the trendy Soho neighborhood.",
    "neighborhood_description": "Soho is a vibrant and artistic neighborhood known for its galleries, boutiques, and trendy restaurants. Home to many artists and celebrities."
  },
  {
    "neighborhood": "South Beach",
    "price": 1000000,
    "bedrooms": 1,
    "bathrooms": 1,
    "house_size": 800,
    "property_description": "Modern condo with ocean views and beach access. Updated kitchen, spacious living area, and balcony. Perfect for a beachfront getaway in South Beach.",
    "neighborhood_description": "South Beach is a lively neighborhood known for its beautiful beaches, vibrant nightlife, and Art Deco architecture. Home to trendy restaurants, clubs, and luxury hotels."
  },
  {
    "neighborhood": "Pacific Heights",
    "price": 3000000,
    "bedrooms": 4,
    "bathrooms": 3,
    "house_size": 2500,
    "property_description": "Classic Victorian home with period details and modern amenities. Formal dining room, landscaped garden, and detached garage. Located in the prestigious Pacific Heights neighborhood.",
    "neighborhood_description": "Pacific Heights is an upscale residential neighborhood with stunning views of the Golden Gate Bridge and San Francisco Bay. Known for its historic homes, boutique shops, and top-rated schools."
  },
  {
    "neighborhood": "Miami Beach",
    "price": 1500000,
    "bedrooms": 3,
    "bathrooms": 2,
    "house_size": 1800,
    "property_description": "Waterfront villa with private dock and pool. Spacious living areas, gourmet kitchen, and outdoor entertaining space. Enjoy luxury living in Miami Beach.",
    "neighborhood_description": "Miami Beach is a glamorous resort city known for its white sand beaches, vibrant nightlife, and Art Deco architecture. Home to upscale shops, restaurants, and cultural attractions."
  },
  {
    "neighborhood": "Tribeca",
    "price": 4000000,
    "bedrooms": 3,
    "bathrooms": 4,
    "house_size": 3000,
    "property_description": "Modern penthouse with panoramic city views. Open floor plan, high-end finishes, and private terrace. Located in the trendy Tribeca neighborhood.",
    "neighborhood_description": "Tribeca is a hip and upscale neighborhood known for its cobblestone streets, loft apartments, and celebrity residents. Home to trendy restaurants, galleries, and luxury boutiques."
  },
  {
    "neighborhood": "Georgetown",
    "price": 2500000,
    "bedrooms": 4,
    "bathrooms": 3,
    "house_size": 2200,
    "property_description": "Historic townhouse with original details and modern updates. Chef's kitchen, formal dining room, and landscaped backyard. Located in the charming Georgetown neighborhood.",
    "neighborhood_description": "Georgetown is a historic and picturesque neighborhood known for its cobblestone streets, historic homes, and upscale shops. Home to Georgetown University, parks, and waterfront dining."
  },
  {
    "neighborhood": "West Hollywood",
    "price": 1800000,
    "bedrooms": 2,
    "bathrooms": 2,
    "house_size": 1600,
    "property_description": "Contemporary condo with designer finishes and city views. Open floor plan, gourmet kitchen, and private balcony. Located in the trendy West Hollywood neighborhood.",
    "neighborhood_description": "West Hollywood is a vibrant and diverse neighborhood known for its nightlife, shopping, and entertainment. Home to the Sunset Strip, famous music venues, and trendy restaurants."
  },
  {
    "neighborhood": "Upper East Side",
    "price": 3500000,
    "bedrooms": 3,
    "bathrooms": 3,
    "house_size": 2800,
    "property_description": "Elegant pre-war apartment with Central Park views. Formal dining room, library, and maid's quarters. Located in the prestigious Upper East Side neighborhood.",
    "neighborhood_description": "Upper East Side is a sophisticated and upscale neighborhood known for its luxury apartments, fine dining, and world-class museums. Home to Central Park, Fifth Avenue shopping, and Madison Avenue galleries."
  }
]